Repository: AbdugofurKomilobv/my_web
Catalog: locale/*/LC_MESSAGES/django.po
Languages: uz

source: About Me
uz: Men Haqimda

source: I am a web developer. My main focus is backend, especially working with the Django framework. I have been involved in projects related to web applications, APIs, and databases for over a year.
uz: Men veb dasturchiman. Asosiy e'tiborim backendga qaratilgan, ayniqsa Django freymvorki bilan ishlash. Men bir yildan ortiq veb ilovalar, API va ma'lumotlar bazalari bilan bog'liq loyihalarda qatnashdim.

source: Web Developer & Backend
uz: Veb Dasturchi va Backend

source: I am a web developer focused on backend development using Django. I enjoy building efficient, scalable web applications and APIs. I am currently learning and growing through freelance and personal projects.
uz: Men Django yordamida backendni rivojlantirishga qaratilgan veb dasturchiman. Men samarali va kengaytiriladigan veb ilovalar va API yaratishdan zavqlanaman. Hozirda freelance va shaxsiy loyihalar orqali o‘rganish va o‘sish bilan shug‘ullanaman.

source: Birthday:
uz: Tug‘ilgan kun:

source: Website:
uz: Vebsayt:

source: Phone:
uz: Telefon:

source: City:
uz: Shahar:

source: Age:
uz: Yosh:

source: Degree:
uz: Daraja:

source: Available
uz: Mavjud

source: I work with Python, Django, PostgreSQL, REST API. I currently work on freelance and personal projects. My goal is to create innovative projects, provide world-class services, and become a strong developer.
uz: Men Python, Django, PostgreSQL, REST API bilan ishlayman. Hozirda freelance va shaxsiy loyihalar ustida ishlayapman. Mening maqsadim innovatsion loyihalar yaratish, dunyo miqyosida xizmatlar ko‘rsatish va kuchli dasturchiga aylanish.

source: Contact
uz: Aloqa

source: Contact me
uz: Mening bilan bog‘laning

source: Address
uz: Manzil

source: Uzbekistan,Kokand
uz: O‘zbekiston, Qo‘qon

source: Call Us
uz: Bizga qo‘ng‘iroq qiling

source: Email Us
uz: Bizga email yuboring

source: Your Name
uz: Ismingiz

source: Your Email
uz: Email manzilingiz

source: Subject
uz: Mavzu

source: Message
uz: Xabar

source: Loading
uz: Yuklanmoqda

source: Your message has been sent. Thank you!
uz: Xabaringiz yuborildi. Rahmat!

source: Send Message
uz: Xabar yuborish

source: I'm
uz: Men

source: Developer
uz: Dasturchiman

source: Backend Developer
uz: Backend Dasturchi

source: Portfolio
uz: Portfel

source: This section provides a brief description of the projects I have developed.
uz: Bu bo‘limda men ishlab chiqqan loyihalar haqida qisqacha tavsif keltirilgan.

source: Online course management system via API
uz: API orqali onlayn kurslarni boshqarish tizimi

source: It allows teachers and students to manage homework, attendance, and statistics via API.
uz: Bu tizim o‘qituvchilarga va talabalarga uy vazifasi, davomat va statistikalarni API orqali boshqarishga imkon beradi.

source: Django REST API Project
uz: Django REST API loyihasi

source: More
uz: Batafsil

source: Resume
uz: Rezyume

source: Bu yerda mening ta'limim va ish tajribam haqida qisqacha ma'lumotlar keltirilgan.
uz: Bu yerda mening ta'limim va ish tajribam haqida qisqacha ma'lumotlar berilgan.

source: Summary
uz: Rezyume

source: Experienced and innovative backend developer with experience in working with Django and REST APIs, microservices architecture, and building backend systems for data analytics.
uz: Yuqori tajribaga ega va innovatsion backend dasturchisi, Django va REST API, mikroservislar arxitekturasi bilan ishlash, ma'lumotlar tahlili uchun backend tizimlarini yaratishda tajribaga ega.

source: Education
uz: Ta'lim

source: Kokand: Vali-teach
uz: Qo‘qon: Vali-teach

source: Tashkent: Najot Ta'lim
uz: Toshkent: Najot Ta'lim

source: Tashkent: Mohir dev
uz: Toshkent: Mohir dev

source: Cybersecurity: Pentesting (Online continues)
uz: Kiberxavfsizlik: Pentesting (Onlayn davom etmoqda)

source: Professional Experience
uz: Kasbiy Tajriba

source: Django RESTful APIs were developed and built with integration in mind.
uz: Django RESTful API'lar ishlab chiqildi va integratsiya e'tiborga olingan holda qurildi.

source: A data model working with PostgreSQL was designed and optimized.
uz: PostgreSQL bilan ishlovchi ma'lumotlar modeli ishlab chiqildi va optimallashtirildi.

source: Integration with the frontend team via API was provided.
uz: Frontend jamoasi bilan API orqali integratsiya ta'minlandi.

source: JWT authentication, OTP login, and permissions based on user roles have been implemented.
uz: JWT autentifikatsiyasi, OTP login va foydalanuvchi rollariga asoslangan huquqlar joriy etilgan.

source: Junior Python Developer
uz: Junior Python Dasturchisi

source: Freelance / Individual Projects
uz: Freelance / Shaxsiy Loyihalar

source: Telegram bots (aiograms) and automated scripts were created.
uz: Telegram botlari (aiogramlar) va avtomatlashtirilgan skriptlar yaratildi.

source: Small projects working with SQL, SQLite3 and MySQL were done.
uz: SQL, SQLite3 va MySQL bilan ishlovchi kichik loyihalar bajarildi.

source: Independent projects were developed based on Python 3.12.3.
uz: Mustaqil loyihalar Python 3.12.3 asosida ishlab chiqildi.

source: Skills
uz: Ko'nikmalar

source: Below are some of my key programming and technology skills.
uz: Quyida mening asosiy dasturlash va texnologiya ko'nikmalarim keltirilgan.

source: Messages
uz: Xabarlar

source: Site Maps
uz: Sayt xaritalari

source: Static Files
uz: Statik Fayllar

source: Syndication
uz: Sindikatsiya

source: That page number is not an integer
uz: Bu sahifa raqami butun son emas

source: That page number is less than 1
uz: Bu sahifa raqami 1 dan kichik

source: That page contains no results
uz: Bu sahifada hech qanday natija yo'q

source: Enter a valid value.
uz: To'g'ri qiymat kiriting.

source: Enter a valid domain name.
uz: To'g'ri domen nomini kiriting.

source: Enter a valid URL.
uz: To'g'ri URL manzilini kiriting.

source: Enter a valid integer.
uz: To'g'ri butun son kiriting.

source: Enter a valid email address.
uz: To'g'ri elektron pochta manzilini kiriting.

source: Enter a valid “slug” consisting of letters, numbers, underscores or hyphens.
uz: Harflar, raqamlar, pastki chiziqlar yoki tirnoqlardan iborat to'g'ri “slug” kiriting.

source: Enter a valid “slug” consisting of Unicode letters, numbers, underscores, or hyphens.
uz: Unicode harflar, raqamlar, pastki chiziqlar yoki tirnoqlardan iborat to'g'ri “slug” kiriting.

source: Enter a valid %(protocol)s address.
uz: To'g'ri %(protocol)s manzilini kiriting.

source: IPv4 or IPv6
uz: IPv4 yoki IPv6

source: Enter only digits separated by commas.
uz: Faqat vergul bilan ajratilgan raqamlarni kiriting.

source: Ensure this value is %(limit_value)s (it is %(show_value)s).
uz: Iltimos, bu qiymat %(limit_value)s bo'lishi kerak (hozirda %(show_value)s).

source: Ensure this value is less than or equal to %(limit_value)s.
uz: Iltimos, bu qiymat %(limit_value)s yoki undan kichik bo'lishi kerak.

source: Ensure this value is greater than or equal to %(limit_value)s.
uz: Iltimos, bu qiymat %(limit_value)s yoki undan katta bo'lishi kerak.

source: Ensure this value is a multiple of step size %(limit_value)s.
uz: Iltimos, bu qiymat %(limit_value)s qadam o'lchoviga ko'paytirilgan bo'lishi kerak.

source: Ensure this value is a multiple of step size %(limit_value)s, starting from %(offset)s, e.g. %(offset)s, %(valid_value1)s, %(valid_value2)s, and so on.
uz: Bu qiymat %(limit_value)s qadam o'lchoviga ko'paytirilgan bo'lishi kerak, %(offset)s dan boshlab, masalan, %(offset)s, %(valid_value1)s, %(valid_value2)s va hokazo.

source: Enter a number.
uz: Raqam kiriting.

source: Null characters are not allowed.
uz: Null belgilari ruxsat etilmaydi.

source: and
uz: va

source: This field cannot be null.
uz: Bu maydon null bo'lishi mumkin emas.

source: This field cannot be blank.
uz: Bu maydon bo'sh bo'lishi mumkin emas.
